package ru.GB.lesson_2;

public class HomeworkTasks {

    public static String task1 = "Задать целочисленный массив, состоящий из элементов 0 и 1. Например: [ 1, 1, 0, 0, 1, 0, 1, 1,0, 0 ].\n" +
            "С помощью цикла и условия заменить 0 на 1, 1 на 0;";

    public static String task2 = "Задать пустой целочисленный массив размером 8. С помощью цикла заполнить его\n" +
            "значениями 0 3 6 9 12 15 18 21;";

    public static String task3 = "Задать массив [ 1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1 ] пройти по нему циклом, и числа меньшие 6\n" +
            "умножить на 2;";

    public static String task4 = "Создать квадратный двумерный целочисленный массив (количество строк и столбцов\n" +
            "одинаковое), и с помощью цикла(-ов) заполнить его диагональные элементы единицами;";

    public static String task5 = "** Задать одномерный массив и найти в нем минимальный и максимальный элементы (без\n" +
            "помощи интернета);";

    public static String task6 = "** Написать метод, в который передается не пустой одномерный целочисленный массив,\n" +
            "метод должен вернуть true, если в массиве есть место, в котором сумма левой и правой части\n" +
            "массива равны. Примеры: checkBalance([2, 2, 2, 1, 2, 2, || 10, 1]) → true, checkBalance([1, 1, 1, ||\n" +
            "2, 1]) → true, граница показана символами ||, эти символы в массив не входят.";

    public static String task7 = "**** Написать метод, которому на вход подается одномерный массив и число n (может быть\n" +
            "положительным, или отрицательным), при этом метод должен сместить все элементы массива\n" +
            "на n позиций. Элементы смещаются циклично. Для усложнения задачи нельзя пользоваться\n" +
            "вспомогательными массивами. Примеры: [ 1, 2, 3 ] при n = 1 (на один вправо) -> [ 3, 1, 2 ]; [ 3, 5,\n" +
            "6, 1] при n = -2 (на два влево) -> [ 6, 1, 3, 5 ]. При каком n в какую сторону сдвиг можете\n" +
            "выбирать сами.";


}
